Revit 2027 API
CurveLoop.Flip Method
 Reverses the orientation of the curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Flip()
Public Sub Flip
public:
void Flip()
member Flip : unit -> unit
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace